In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("titles.csv")
df.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [26]:
df1=df.groupby(['title']).count()
df1.sort_values(by=['year']).tail(10)

                      year
title
Honeymoon               11
Othello                 11
Freedom                 11
The Three Musketeers    11
The Outsider            12
Maya                    12
Temptation              12
Macbeth                 16
Carmen                  17
Hamlet                  20

In [18]:
df1=df[df["year"].between(1930,1940)]
df2=df1.groupby(['year']).count()
df2.sort_values(by=['title']).tail(3)

      title
year
1938   1163
1936   1169
1937   1224

In [27]:
df1 = pd.read_csv("cast.csv")
df1.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [71]:
def get_decade(year):
    return int(year/10)*10

In [72]:
df1['decade']=df1['year'].apply(get_decade)

In [73]:
df1.groupby(['decade']).size()

decade
1890          3
1900         70
1910      43435
1920      72801
1930     201262
1940     214159
1950     215471
1960     192349
1970     219785
1980     289039
1990     388040
2000     753409
2010    1196083
2020        267
2110          3
dtype: int64

In [74]:
df2=df1[df1['title']=='Hamlet']
df2.groupby(['decade']).size()

decade
1910    28
1920     9
1940    24
1950     5
1960    57
1970    19
1980     3
1990    83
2000    55
2010    59
dtype: int64

In [76]:
df2=df1[df1['character']=='Rustler']
df2.groupby(['decade']).size()

decade
1920     6
1930    84
1940    18
1950     8
1960     2
1970     9
1980     1
1990     4
2000     2
dtype: int64

In [77]:
df2=df1[df1['character']=='Hamlet']
df2.groupby(['decade']).size()

decade
1910     6
1920     1
1930     6
1940     1
1950     4
1960     7
1970     8
1980     2
1990    11
2000    19
2010    31
dtype: int64

In [55]:
df2=df1.groupby(['character']).size()
df2.sort_values(ascending=True).tail(11)

character
Herself         6705
Bartender       6802
Nurse           6999
Policeman       7029
Party Guest     7245
Doctor          7669
Student         7773
Reporter        8434
Extra          11948
Dancer         12477
Himself        20746
dtype: int64

In [54]:
df2=df1[df1['character']=='Herself']
df3=df2.groupby(['name']).size()
df3.sort_values(ascending=True).tail(10)

name
Rekha                         6
Marilyn Monroe                6
Mar?a Isabel (III) Mart?n     6
In?s J. Southern              6
Hillary Clinton               8
Margaret Thatcher             8
Mar?a Luisa (V) Mart?n        9
Luisa Horga                   9
Joyce Brothers                9
Queen Elizabeth II           12
dtype: int64

In [78]:
df2=df1[df1['character']=='Himself']
df3=df2.groupby(['name']).size()
df3.sort_values(ascending=True).tail(10)

name
Franklin D. Roosevelt    21
Ron Jeremy               22
Bill Clinton             22
Martin Luther King       23
Winston Churchill        24
George W. Bush           25
John F. Kennedy          37
Ronald Reagan            41
Richard Nixon            44
Adolf Hitler             99
dtype: int64

In [53]:
df2=df1[df1['year']==1945]
df3=df2.groupby(['name']).size()
df3.sort_values(ascending=True).tail(1)

name
Emmett Vogan    39
dtype: int64

In [51]:
df2=df1[df1['year']==1985]
df3=df2.groupby(['name']).size()
df3.sort_values(ascending=True).tail(1)

name
Mammootty    22
dtype: int64

In [47]:
df2=df1[df1['name']=='Mammootty']
df3=df2.groupby(['year']).size()
df3

year
1971     1
1980     2
1981     3
1982     7
1983    18
1984    16
1985    22
1986    18
1987    10
1988     7
1989    10
1990    16
1991     6
1992     3
1993     5
1994     5
1995     5
1996     5
1997     2
1998     4
1999     4
2000     7
2001     3
2002     3
2003     2
2004     8
2005     6
2006     8
2007     7
2008     9
2009    12
2010     9
2011     7
2012     7
2013     5
2014     6
2015     6
2016     4
2017     2
dtype: int64

In [84]:
df2=df1[df1["character"].str.startswith('Patron in')]
df3=df2.groupby(['character']).size()
df3.sort_values(ascending=True).tail(10)

character
Patron in Coffee Shop            2
Patron in Restaurant             3
Patron in cabaret                3
Patron in Club                   3
Patron in Bar                    4
Patron in restaurant             4
Patron in Billiard Parlor        5
Patron in Chinese Restaurant     9
Patron in the Coffee House       9
Patron in Frisky Rabbit         16
dtype: int64

In [85]:
df2=df1[df1["character"].str.startswith('Science')]
df3=df2.groupby(['character']).size()
df3.sort_values(ascending=True).tail(10)

character
Science                  4
Science Kid              5
Science Reporter         5
Science Fair Kid         5
Science Club Member      5
Science Promo Cadet      5
Science Fair Judge       6
Science Student          9
Science Fair Student     9
Science Teacher         60
dtype: int64

In [65]:
df2=df1[df1['name']=='Judi Dench']
df3=df2.groupby(['n']).size()
[df3]

n
1.0     7
2.0     6
3.0     6
4.0     4
5.0     2
6.0     4
7.0     4
8.0     1
9.0     1
11.0    1
12.0    3
13.0    2
16.0    2
18.0    2
20.0    1
23.0    1
26.0    1
29.0    1
39.0    1
40.0    1
dtype: int64

In [66]:
df2=df1[df1['name']=='Cary Grant']
df3=df2.groupby(['n']).size()
[df3]

[n
 1.0     45
 2.0     20
 3.0      2
 4.0      1
 5.0      1
 8.0      1
 9.0      1
 10.0     2
 dtype: int64]

In [67]:
df2=df1[df1['name']=='Sidney Poitier']
df3=df2.groupby(['n']).size()
[df3]

[n
 1.0     21
 2.0      8
 3.0      6
 4.0      3
 5.0      1
 10.0     1
 13.0     1
 21.0     1
 dtype: int64]

In [87]:
df2=df1[df1['n']==1]
df3=df2[df2['year'].between(1950,1959)]
df3.groupby(['type']).size()

type
actor      6692
actress    3040
dtype: int64

In [86]:
df2=df1[df1['n']==2]
df3=df2[df2['year'].between(1950,1959)]
df3.groupby(['type']).size()

type
actor      4640
actress    4635
dtype: int64